class Governorates {
  static const Map<String, int> deliveryFees = {
    'القاهرة': 80,
    'الجيزة': 80,
    'الإسكندرية': 90,
    'القليوبية': 100,
    'المنوفية': 100,
    'الشرقية': 100,
    'الغربية': 100,
    'البحيرة': 100,
    'الدقهلية': 100,
    'كفر الشيخ': 100,
    'الإسماعيلية': 100,
    'السويس': 100,
    'بورسعيد': 100,
    'دمياط': 100,
    'دمياط الجديدة': 100,
    'الفيوم': 110,
    'بني سويف': 110,
    'المنيا': 110,
    'أسيوط': 120,
    'سوهاج': 120,
    'البحر الأحمر': 120,
    'قنا': 120,
    'الأقصر': 120,
    'أسوان': 120,
    'شمال سيناء': 130,
    'جنوب سيناء': 130,
    'مطروح': 130,
    'الوادي الجديد': 130,
  };

  static List<String> get all => deliveryFees.keys.toList();
}
